// © Copyright 2011-2013, 2015-2016 HP Development Company, L.P.

TaskName = "Настройка беспроводной связи";
TaskTOCTitle = "Автоматическое беспроводное подключение HP";
ConfirmSettingsTaskName = "Подтвердить беспроводное автоматическое подключение HP";
ConfirmSettingsTaskTOCTitle = "Подтвердите параметры беспроводного подключения";
NetworkSelectTaskName = "Выберите сеть";
DeviceDiscoveryTaskName = "Выбор устройства";
DeviceDiscoveryTaskTitle = "Выберите устройство, которое необходимо настроить";
ConfigureSettingsTaskName = "Настройка устройства";
ResultsTaskName = "Результаты настройки";

// confirmation pane
ConfirmationDescriptionText = "Чтобы воспользоваться функцией автоматического беспроводного подключения HP, компьютер необходимо временно отключить от беспроводной сети, поэтому следует завершить все начатые загрузки. Подключение будет восстановлено примерно через тридцать секунд.";
HostNetworkDetectedTitle = "Программа определила, что компьютер подключен к беспроводной сети с использованием следующих параметров:";
WirelessNetworkNameTitle = "Имя беспроводной сети:";
CommunicationModeTitle = "Режим связи:";
EncryptionTypeTitle = "Тип шифрования:";

WirelessNetworkChooseTitle = "Настроить устройство с использованием указанных выше параметров?";
KeepCurrentNetworkSettingsTitle = "Да, использовать эти параметры.";
ChooseAnotherNetworkSettingsTitle = "Нет, я выберу другую сеть.";
ShowSettingsTitle = "Показать параметры";

// network selection pane
NetworkSelectTitle = "Выберите имя беспроводной сети из списка ниже.";
SelectedNetworkPasswordTitle = "Пароль:";
NetworkSelectContinueDescription= "Щелкните \"Продолжить\", чтобы добавить устройство в \"%@\".";
NetworkDiscoveryFailedTitle = "Сбой обнаружения сети";
NetworkDiscoveryFailedDescription = "Беспроводные сети не обнаружены.";
SetupNetworkSelectedTitle = "Выбрать другую сеть";
SetupNetworkSelectedDescription = "Выполняется попытка подключения к сети, созданной устройством печати. Щелкните \"OK\" и выберите другую сеть.";

DeviceNetworkNotAvailableTitle = "Сеть недоступна";
DeviceNetworkNotAvailableMessageFormat = "Устройству не удалось получить доступ к беспроводной сети \"%@\". Убедитесь, что беспроводная точка доступа работает правильно и расположена в зоне действия устройства, или выберите другую сеть.";
MacNetworkNotAvailableMessageFormat = "Компьютеру Mac не удалось получить доступ к беспроводной сети \"%@\". Убедитесь, что беспроводная точка доступа работает правильно и расположена в зоне действия компьютера, или выберите другую сеть.";
ChangeNetworkButtonTitle= "Сменить сеть";

LookingForNetworkMessageFormat = "Поиск сети: \"%@\"";

UnsupportedNetworkTitle = "Неподдерживаемая сеть";
UnsupportedNetworkMessageFormat = "Выберите другую сеть или обратитесь к администратору.";

EnterpriseNetworkAlertTitle = "Выбрана корпоративная сеть";
EnterpriseNetworkAlertForUSBConnectionMessage = "Сеть защищена с помощью шифрования корпоративных данных. Подключите принтер к той же сети, к которой подключен компьютер, и используйте Встроенный Web-сервер или обратитесь к администратору.";
EnterpriseNetworkAlertForNetworkConnectionMessage = "Сеть защищена с помощью шифрования корпоративных данных. Чтобы подключить принтер к сети, используйте Встроенный Web-сервер (EWS) или обратитесь к администратору. При выборе EWS компьютер отключится от беспроводной сети и подключится к специальной сети, созданной принтером.";
ConfigureUsingEWSButtonTitle = "Настройка с помощью EWS";
ConnectingToDeviceProgressTitle = "Выполняется подключение к сети устройства...";

UnableToConnectToDeviceNetworkAlertMessage = "Убедитесь, что устройство находится достаточно близко к компьютеру и мигает голубой индикатор (он указывает, что устройство находится в режиме \"Автоматическое беспроводное подключение HP\"). Чтобы сбросить настройки подключения, выберите на панели управления устройства \"Восстановить настройки сети по умолчанию\". Подробную информацию см. в документации к устройству.";

// select device
DeviceNameColumnTitle = "Имя устройства";
DeviceModelColumnTitle = "Модель устройства";
AllFilterTitle = "Все";
DevicesFilterLabel = "Устройства:";
SupportedDevicesFilterTitle = "Поддерживаемые";

// configure
ConfigureTaskName = "Настройка устройства HP";
ConfigureTitle = "Настройка…";
NoteTitle = "Выполняется настройка беспроводного подключения устройства HP. Это может занять несколько минут.";
RestoringNetworkSettings = "Восстановление параметров сети...";

// particular errors
IncorrectPasswordTitle = "Пароль не принят";
IncorrectPasswordDescription = "Пароль не был принят беспроводной сетью \"%@\".\n\nВведите пароль еще раз.";

DuplicateNetworkNameErrorTitle = "Дублирующиеся имена сетей WiFi";
DuplicateNetworkNameErrorDescription = "Обнаружены дублирующиеся имена сетей WiFi: \"%@\". Проверьте параметры беспроводного маршрутизатора.";

MacAddressFilterErrorTitle = "Ошибка фильтра WiFi";
MacAddressFilterErrorDescription = "Аппаратный MAC-адрес устройства был отфильтрован и недоступен в \"%@\". Проверьте параметры беспроводного маршрутизатора.";

WeakSignalStrengthErrorTitle = "Низкий уровень сигнала";
WeakSignalStrengthErrorDescription = "Низкий уровень сигнала беспроводного маршрутизатора \"%@\". Переместите устройство ближе к маршрутизатору.";

DeviceNotReachableErrorTitle = "Устройство недоступно";
DeviceNotReachableErrorDescription = "Параметры беспроводной сети успешно загружены на устройство. Однако компьютеру Mac не удалось обнаружить устройство в сети.\n\nПроверьте следующее.\n• Компьютер Mac подключен к проводной или беспроводной сети, которая имеет доступ к устройству.\n• Устройство подключено к беспроводной сети \"%@\".";

EmptyPasswordError = "Необходимо ввести пароль.";
TooShortWPAPersonalPasswordError = "Пароль должен содержать не менее 8 символов.";
TooLongWPAPersonalPasswordError = "Пароль должен содержать не более 64 символов.";

// restore original network errors

FailedToRestoreOriginalNetworkErrorTitle = "Не удается восстановить подключение к оригинальной беспроводной сети";

NoPasswordIsStoredInKeychainErrorMessageFormat = "Помощнику не удалось получить учетные данные для подключения к беспроводной сети \"%@\" среди ваших ключей. Убедитесь, что ваше устройство Mac подключено к проводной или беспроводной сети, у которой есть доступ к вашему устройству.";
PasswordFromKeychainNotAcceptedErrorMessageFormat = "Беспроводная сеть \"%@\" не принимает ваши учетные данные. Убедитесь, что ваш Mac подключен к проводной или беспроводной сети, у которой есть доступ к вашему устройству.";
FailedToRestoreOriginalNetworkGenericErrorMessage = "Убедитесь, что беспроводная точка доступа работает правильно и распознается вашим устройством Mac, а затем попытайтесь установить подключение вручную.";

// results
ManualNetworkConfigurationTitle = "Вручную";
AutoNetworkConfigurationTitle = "Автоматически";
LinklocalNetworkConfigurationTitle = "Локальный адрес канала";
NetworkSettingsTitle = "Параметры сети";
ConfigurationFailedTaskName = "Не удалось выполнить настройку";
ConfigurationCompleteTaskName = "Настройка завершена";
ConfigurationFailedTitle = "Программе не удалось настроить устройство с помощью беспроводного подключения.";
ConfigurationSucceededTitle = "Теперь устройство HP правильно настроено и подключено к сети \"%@\".";

ConfigurationFailedNote = "Убедитесь, что беспроводная точка доступа работает исправно, а устройство находится в диапазоне покрытия сети в режиме ожидания. Щелкните \"Повторить\", чтобы повторить попытку.\n\n%@";
UnableToConnectToDeviceNetworkUSBSOWMessage = "Убедитесь, что устройство включено и находится достаточно близко к компьютеру. Нажмите \"Повторить попытку\". Голубой индикатор на устройстве должен мигать (он указывает, что устройство находится в режиме \"Автоматическое беспроводное подключение HP\"). Режим активируется при первом включении устройства и действует в течение часа, пока не будет установлено подключение к сети.\n\n%@";
UnableToConnectToDeviceNetworkFPWithoutIndicatorSOWMessage = "Убедитесь, что устройство расположено в пределах видимости от компьютера и находится в режиме автоматического беспроводного подключения HP. Затем щелкните \"Повторить\", чтобы попытаться снова. Вы можете сбросить режим автоматического беспроводного подключения HP с помощью пункта \"Восстановить параметры сети по умолчанию\" на панели управления устройства. Как это сделать см. в документации устройства.\n\n%@";
UnableToConnectToDeviceNetworkFPWithIndicatorSOWMessage = "Убедитесь, что устройство находится достаточно близко к компьютеру и мигает голубой индикатор (он указывает, что устройство находится в режиме \"Автоматическое беспроводное подключение HP\"). Нажмите \"Повторить попытку\". Чтобы сбросить настройки подключения, выберите на панели управления устройства \"Восстановить настройки сети по умолчанию\". Подробную информацию см. в документации к устройству.\n\n%@";
ConfigurationFailedUSBSOWPart = "Также попробуйте настроить устройство следующим образом. Подключите устройство к компьютеру с помощью USB-кабеля и щелкните \"Повторить\". Когда настройка устройства будет выполнена, и устройство будет готово подключиться к выбранной сети, отсоедините его от компьютера.";
ConfigurationFailedFPSOWPart = "Можно настроить устройство для подключения к беспроводной сети, используя мастер настройки беспроводной сети на панели управления устройства. Для настройки устройства выполните следующие действия.
       1. Нажмите кнопку \"Беспроводная\" или коснитесь соответствующего значка на устройстве.
       2. На экране устройства откройте окно состояния беспроводной сети и выберите \"Параметры\".
       3. Выберите \"Мастер настройки беспроводной сети\" и следуйте инструкциям на экране.


После завершения работы мастера устройство автоматически подключится к сети.";

ConfigurationOverUSBFailedTitle = "Программе не удалось настроить устройство с помощью USB-кабеля.";
ConfigurationOverUSBFailedNote = "Убедитесь, что беспроводная точка доступа работает исправно, а устройство находится в диапазоне покрытия сети в режиме ожидания. Щелкните \"Повторить\", чтобы повторить попытку.";
MoreInfoText = "Дополнительные сведения см. по адресу:";
FailedTitle = "Не удалось получить сведения о сети";
BonjourServiceNameLabel = "Имя службы Bonjour:";
IPAddress = "IP-адрес:";
AddressMode = "Режим адреса:";
SubnetMask = "Маска подсети:";
DefaultGateway = "Шлюз по умолчанию:";
HostName = "Имя узла:";
PrefixLength = "Длина префикса:";
DisconnectUSBWarningText = "<b>Важно!</b> Отсоедините USB-кабель, подключенный к устройству.";
DeviceNotLocatedWarningText = "Параметры беспроводной сети были загружены на устройство, однако ПК Mac не удалось обнаружить устройство в сети.";

// network settings
Adhoc = "Прямое соединение";
Infrastructure = "Инфраструктура";

// select network
NetworkColumnTitle = "Сеть";
SignalStrengthColumnTitle = "Уровень сигнала";
EncryptionColumnTitle = "Шифрование";
ModeColumnTitle = "Режим";
